Q1. List any five functions of the pandas library with execution.

In [2]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [6]:
df.iloc[0:4, 1:5]

   Survived  Pclass                                               Name     Sex
0         0       3                            Braund, Mr. Owen Harris    male
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2         1       3                             Heikkinen, Miss. Laina  female
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female

In [7]:
s = pd.Series([1,3,4,6,7])
print(s)

0    1
1    3
2    4
3    6
4    7
dtype: int64

In [8]:
Name = pd.Series(['Alice','Bob','Claire'])
Age = pd.Series([25,30,27])
Gender = pd.Series(['Female','Male','Female'])

df = pd.concat({"Name":Name, "Age":Age, "Gender":Gender},axis=1)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [66]:
data = { 
         "A": ['Alice','Bob','Claire','Tom','Rob','Dan','Stuart'],
         "B": [25,30,27,32,42,21,23],
         "C": ['Female','Male','Female','Male','Male','Male','Male']
       }

#new_index = [j for j in range(1,len(data['A'])*2) if j % 2 != 0]
#df = pd.DataFrame(data,index=new_index)

df = pd.DataFrame(data)
print(df)
df1 = df.reindex([j for j in range(1,len(data['A'])*2) if j % 2 != 0])
print('\n Dataframe after reindex...\n')
print(df1)

        A   B       C
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female
3     Tom  32    Male
4     Rob  42    Male
5     Dan  21    Male
6  Stuart  23    Male

 Dataframe after reindex...

      A     B     C
1   Bob  30.0  Male
3   Tom  32.0  Male
5   Dan  21.0  Male
7   NaN   NaN   NaN
9   NaN   NaN   NaN
11  NaN   NaN   NaN
13  NaN   NaN   NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [3]:
d = {"Values" :  [10, 20, 30, 40, 50]}    
df = pd.DataFrame(d)

def valsum1(f):
    sum  = 0
    for i, row in f.iterrows():
        if i < 3:
            sum = sum + row['Values']
    print(sum)

valsum1(df)

60

In [4]:
# shortcut
df['Values'][0:3].sum()

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [20]:
dtext  = {"Text": ["You have a Pandas DataFrame df with a column named 'Values'",
                   "List any five functions of the pandas library with execution",
                    "Which function of pandas do we use to read an excel file?",
                     "To use the basic functions of pandas, what library needs to be imported?"
                  ]
         }

df = pd.DataFrame(dtext)
pd.set_option('display.max_colwidth', 200)

df['Word_Count'] = df['Text'].apply(lambda x: len(x.split()))
print(df)

                                                                       Text  \
0               You have a Pandas DataFrame df with a column named 'Values'
1              List any five functions of the pandas library with execution
2                 Which function of pandas do we use to read an excel file?
3  To use the basic functions of pandas, what library needs to be imported?

   Word_Count
0          11
1          10
2          12
3          13

Q5. How are DataFrame.size() and DataFrame.shape() different?

A5: 
size - Returns size of dataframe/series which is equivalent to total number of elements.

shape - Returns number of rows and columns of dataframe as tuple

In [67]:
data = { 
         "A": ['Alice','Bob','Claire','Tom','Rob','Dan','Stuart'],
         "B": [25,30,27,32,42,21,23],
         "C": ['Female','Male','Female','Male','Male','Male','Male']
       }

df = pd.DataFrame(data)
print(df)
print('\n')
print('Size of DataFrame is {}'.format(df.size))
print('Shape of DataFrame is {}'.format(df.shape))

        A   B       C
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female
3     Tom  32    Male
4     Rob  42    Male
5     Dan  21    Male
6  Stuart  23    Male


Size of DataFrame is 21
Shape of DataFrame is (7, 3)

Q6. Which function of pandas do we use to read an excel file?

A6. pandas' read_excel() function is used to read Excel file.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [20]:
demail = {"Email": ["tom.ford@gmail.com","alps_pat@gmail.com","nickstoke@outlook.com","nancy_robert@live.ca",
                    "whats.your.name@msn.com"]}

df = pd.DataFrame(demail)

def f(df):
    df['Username'] = df['Email'].apply(lambda x: x.split('@')[0]) 
    
f(df)

print(df)

None

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [19]:
data = { 'A': [3,8,6,2,9],
         'B': [5,2,9,3,1],
         'C': [1,7,4,5,2]
       }

df = pd.DataFrame(data)

def f(df):
    return df[(df['A'] > 5) & (df['B'] < 10)]

df1 = f(df)
print(df1)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [28]:
d = {"Values" :  [10, 20, 30, 40, 50]}    
df = pd.DataFrame(d)

print("Mean is {}".format(df.mean()[0]))
print("Median is {}".format(df.median()[0]))
print("Standard deviation is {}".format(df.std()[0]))

Mean is 30.0
Median is 30.0
Standard deviation is 15.811388300841896

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [47]:
import pandas as pd
import random 

date = pd.Series(pd.date_range('2023-02-01', '2023-02-28'))
sales = pd.Series([random.randint(8000,10000) for i in range (1,29)])

df = pd.concat({"Date":date, "Sales":sales},axis=1)

df['MovingAverage'] = df['Sales'].rolling(window=7).mean()

print(df)

         Date  Sales  MovingAverage
0  2023-02-01   9818            NaN
1  2023-02-02   9196            NaN
2  2023-02-03   8568            NaN
3  2023-02-04   9535            NaN
4  2023-02-05   9798            NaN
5  2023-02-06   8612            NaN
6  2023-02-07   9008    9219.285714
7  2023-02-08   9029    9106.571429
8  2023-02-09   8561    9015.857143
9  2023-02-10   9699    9177.428571
10 2023-02-11   9808    9216.428571
11 2023-02-12   8869    9083.714286
12 2023-02-13   8893    9123.857143
13 2023-02-14   8767    9089.428571
14 2023-02-15   9167    9109.142857
15 2023-02-16   8054    9036.714286
16 2023-02-17   9005    8937.571429
17 2023-02-18   8447    8743.142857
18 2023-02-19   9943    8896.571429
19 2023-02-20   8978    8908.714286
20 2023-02-21   8492    8869.428571
21 2023-02-22   8489    8772.571429
22 2023-02-23   9211    8937.857143
23 2023-02-24   8949    8929.857143
24 2023-02-25   8787    8978.428571
25 2023-02-26   8912    8831.142857
26 2023-02-27   8454    8756.285714
27 2023-02-28   8033    8690.714286

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [46]:
df = pd.Series(pd.date_range('2023-02-01', '2023-02-28')).to_frame()
df.rename(columns={0: 'Date'}, inplace=True)

df['Day'] = df['Date'].apply(lambda x : x.day_name())
print(df)

         Date        Day
0  2023-02-01  Wednesday
1  2023-02-02   Thursday
2  2023-02-03     Friday
3  2023-02-04   Saturday
4  2023-02-05     Sunday
5  2023-02-06     Monday
6  2023-02-07    Tuesday
7  2023-02-08  Wednesday
8  2023-02-09   Thursday
9  2023-02-10     Friday
10 2023-02-11   Saturday
11 2023-02-12     Sunday
12 2023-02-13     Monday
13 2023-02-14    Tuesday
14 2023-02-15  Wednesday
15 2023-02-16   Thursday
16 2023-02-17     Friday
17 2023-02-18   Saturday
18 2023-02-19     Sunday
19 2023-02-20     Monday
20 2023-02-21    Tuesday
21 2023-02-22  Wednesday
22 2023-02-23   Thursday
23 2023-02-24     Friday
24 2023-02-25   Saturday
25 2023-02-26     Sunday
26 2023-02-27     Monday
27 2023-02-28    Tuesday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [56]:
df = pd.Series(pd.date_range('2023-01-01', '2023-02-28')).to_frame()
df.rename(columns={0: 'Date'}, inplace=True)
print(df)

df[(df['Date'] > pd.to_datetime('2023-01-01')) & (df['Date'] < pd.to_datetime('2023-01-31'))]

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31
31 2023-02-01
32 2023-02-02
33 2023-02-03
34 2023-02-04
35 2023-02-05
36 2023-02-06
37 2023-02-07
38 2023-02-08
39 2023-02-09
40 2023-02-10
41 2023-02-11
42 2023-02-12
43 2023-02-13
44 2023-02-14
45 2023-02-15
46 2023-02-16
47 2023-02-17
48 2023-02-18
49 2023-02-19
50 2023-02-20
51 2023-02-21
52 2023-02-22
53 2023-02-23
54 2023-02-24
55 2023-02-25
56 2023-02-26
57 2023-02-27
58 2023-02-28

         Date
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

A13. pandas